aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_bsp/mcu/rx23t/register_access/ccrx/iodefine.h
#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define	BSC		(*(volatile struct st_bsc        __evenaccess *)0x81300)
#define	CAC		(*(volatile struct st_cac        __evenaccess *)0x8B000)
#define	CMPC0	(*(volatile struct st_cmpc0      __evenaccess *)0xA0C80)
#define	CMPC1	(*(volatile struct st_cmpc1      __evenaccess *)0xA0CA0)
#define	CMPC2	(*(volatile struct st_cmpc1      __evenaccess *)0xA0CC0)
#define	CMT		(*(volatile struct st_cmt        __evenaccess *)0x88000)
#define	CMT0	(*(volatile struct st_cmt0       __evenaccess *)0x88002)
#define	CMT1	(*(volatile struct st_cmt0       __evenaccess *)0x88008)
#define	CMT2	(*(volatile struct st_cmt0       __evenaccess *)0x88012)
#define	CMT3	(*(volatile struct st_cmt0       __evenaccess *)0x88018)
#define	CRC		(*(volatile struct st_crc        __evenaccess *)0x88280)
#define	DA		(*(volatile struct st_da         __evenaccess *)0x880C0)
#define	DOC		(*(volatile struct st_doc        __evenaccess *)0x8B080)
#define	DTC		(*(volatile struct st_dtc        __evenaccess *)0x82400)
#define	FLASH	(*(volatile struct st_flash      __evenaccess *)0x7FC100)
#define	FLASHCONST		(*(volatile struct st_flashconst __evenaccess *)0x7FC350)
#define	ICU		(*(volatile struct st_icu        __evenaccess *)0x87000)
#define	IWDT	(*(volatile struct st_iwdt       __evenaccess *)0x88030)
#define	MPC		(*(volatile struct st_mpc        __evenaccess *)0x8C11F)
#define	MPU		(*(volatile struct st_mpu        __evenaccess *)0x86400)
#define	MTU		(*(volatile struct st_mtu        __evenaccess *)0xC120A)
#define	MTU0	(*(volatile struct st_mtu0       __evenaccess *)0xC1290)
#define	MTU1	(*(volatile struct st_mtu1       __evenaccess *)0xC1290)
#define	MTU2	(*(volatile struct st_mtu2       __evenaccess *)0xC1292)
#define	MTU3	(*(volatile struct st_mtu3       __evenaccess *)0xC1200)
#define	MTU4	(*(volatile struct st_mtu4       __evenaccess *)0xC1200)
#define	MTU5	(*(volatile struct st_mtu5       __evenaccess *)0xC1294)
#define	POE		(*(volatile struct st_poe        __evenaccess *)0x8C4C0)
#define	PORT0	(*(volatile struct st_port0      __evenaccess *)0x8C000)
#define	PORT1	(*(volatile struct st_port1      __evenaccess *)0x8C001)
#define	PORT2	(*(volatile struct st_port2      __evenaccess *)0x8C002)
#define	PORT3	(*(volatile struct st_port3      __evenaccess *)0x8C003)
#define	PORT4	(*(volatile struct st_port4      __evenaccess *)0x8C004)
#define	PORT7	(*(volatile struct st_port7      __evenaccess *)0x8C007)
#define	PORT9	(*(volatile struct st_port9      __evenaccess *)0x8C009)
#define	PORTA	(*(volatile struct st_porta      __evenaccess *)0x8C00A)
#define	PORTB	(*(volatile struct st_portb      __evenaccess *)0x8C00B)
#define	PORTD	(*(volatile struct st_portd      __evenaccess *)0x8C00D)
#define	PORTE	(*(volatile struct st_porte      __evenaccess *)0x8C04E)
#define	RIIC0	(*(volatile struct st_riic       __evenaccess *)0x88300)
#define	RSPI0	(*(volatile struct st_rspi       __evenaccess *)0x88380)
#define	S12AD	(*(volatile struct st_s12ad      __evenaccess *)0x89000)
#define	SCI1	(*(volatile struct st_sci        __evenaccess *)0x8A020)
#define	SCI5	(*(volatile struct st_sci        __evenaccess *)0x8A0A0)
#define	SMCI1	(*(volatile struct st_smci       __evenaccess *)0x8A020)
#define	SMCI5	(*(volatile struct st_smci       __evenaccess *)0x8A0A0)
#define	SYSTEM	(*(volatile struct st_system     __evenaccess *)0x80000)
#define	TMR0	(*(volatile struct st_tmr0       __evenaccess *)0x88200)
#define	TMR1	(*(volatile struct st_tmr1       __evenaccess *)0x88201)
#define	TMR2	(*(volatile struct st_tmr0       __evenaccess *)0x88210)
#define	TMR3	(*(volatile struct st_tmr1       __evenaccess *)0x88211)
#define	TMR01	(*(volatile struct st_tmr01      __evenaccess *)0x88204)
#define	TMR23	(*(volatile struct st_tmr01      __evenaccess *)0x88214)
#pragma bit_order
#pragma packoption
#endif